# parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [13,17,  31,25,  24,51, 61,45]  # P3/8
  - [48,102,  119,96, 97,189, 217,184]  # P4/16
  - [171,384, 324,451, 616,618, 800,800]  # P5/32

# CSPDarknet-19 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],  # 0-p1/2
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 1, BottleneckCSP, [64]],
   [-1, 1, nn.MaxPool2d, [2, 2]],   # 3-P3/8
   [-1, 1, BottleneckCSP, [128]],
   [-1, 1, nn.MaxPool2d, [2, 2]],   # 5-P4/16
   [-1, 1, BottleneckCSP, [256]],
   [-1, 1, nn.MaxPool2d, [2, 2]],   # 7-P5/32
   [-1, 1, Conv, [512, 3, 1]],
  ]

# yolov4-p5 head
# na = len(anchors[0])
head:
  [[-1, 1, Bottleneck, [512, False]],  # 9

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 6], 1, Concat, [1]],  # concat backbone P4
   [-1, 1, Conv, [256, 1, 1]],  # 13

    [-1, 1, Conv, [128, 1, 1]], # 14
   [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ],
   [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # concat backbone P3
   [ -1, 1, Conv, [ 128, 1, 1 ] ],  # 17
   [-1, 1, Bottleneck, [128, False]], # 18

   [[18, 13, 9], 1, Detect, [nc, anchors]],   # Detect(P4, P5)
  ]